import React from 'react';
import "./swiper.scss"
import First from './First/./First'
const Swiper = () => {
    return (
        <section className='swipers'>
            <div className="container">
                <h2 className="swipers__title"></h2>
                <div className="swipers__wrapper">
                    <First/>
                     <div className="swipers">
                        <h3 className="swipers__subtitle">Светло–бирюзовый
                            стеклянный камень</h3>
                        <p className="swipers__text">Голубой камень прекрасно будет смотреться в вашем интерьере <br/>
                            и ландшафтном дизайне. <br/>
                            Это один из самых популярных цветов...</p>
                        <h4 className="swipers__price">45 руб/кг</h4>
                        <div className="swipers__box">
                            <div className="swipers__plus">
                                <button className='swipers__add'>-</button>
                                <p className="swipers__piece">1 шт</p>
                                <button className='swipers__add'>+</button>
                            </div>
                            <div className="swipers__basket">
                                <p className="swipers__txt">в корзину</p>
                                <div className="swipers__svg">
                                    <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M0.809823 0.00998723L0.718625 0.00044944C0.386744 -0.0116831 0.0887063 0.223017 0.030495 0.559349L0.0209573 0.650547C0.00882471 0.982428 0.243525 1.28047 0.579857 1.33868L1.9364 1.57329L2.75852 11.3681L2.77554 11.5154C2.94095 12.6323 3.90162 13.472 5.04582 13.472H14.8553L15.003 13.4673C16.0785 13.3986 16.9702 12.5853 17.1272 11.5049L17.9803 5.60911L17.9951 5.47368C18.0736 4.39576 17.2196 3.46022 16.1201 3.46022H3.44755L3.23654 0.941565L3.22064 0.841911C3.15911 0.582721 2.94841 0.380127 2.67966 0.333614L0.809823 0.00998723ZM4.94161 12.1178C4.49638 12.0691 4.14031 11.7116 4.10228 11.2557L3.56083 4.80866H16.1201L16.1994 4.81449C16.4832 4.85669 16.6883 5.12213 16.6458 5.41605L15.7927 11.3114L15.7713 11.4168C15.6631 11.829 15.2896 12.1235 14.8553 12.1235H5.04583L4.94161 12.1178ZM3.53415 16.2581C3.53415 15.5065 4.14335 14.8962 4.89518 14.8962C5.64691 14.8962 6.25711 15.5064 6.25711 16.2581C6.25711 17.0099 5.6468 17.6192 4.89518 17.6192C4.14346 17.6192 3.53415 17.0098 3.53415 16.2581ZM13.6487 16.2581C13.6487 15.5064 14.2589 14.8962 15.0106 14.8962C15.7624 14.8962 16.3726 15.5064 16.3726 16.2581C16.3726 17.0099 15.7623 17.6192 15.0106 17.6192C14.259 17.6192 13.6487 17.0099 13.6487 16.2581ZM14.0881 7.45699C14.0881 7.08463 13.7862 6.78277 13.4138 6.78277H10.921L10.8295 6.78893C10.5004 6.83357 10.2468 7.11566 10.2468 7.45699C10.2468 7.82935 10.5486 8.13121 10.921 8.13121H13.4138L13.5053 8.12506C13.8344 8.08041 14.0881 7.79832 14.0881 7.45699Z" fill="white"/>
                                    </svg>
                                </div>
                            </div>
                        </div>
                        <ul className="swipers__ul">
                            <li className="swipers__list">— Готов к отгрузке</li>
                            <li className="swipers__list"> — Индивидуальные скидки от объема</li>
                            <li className="swipers__list">— Гарантия лучшей цены</li>
                            <li className="swipers__list">— Бережная доставка без сколов и других повреждений</li>
                        </ul>

                    </div>
                </div>
            </div>
        </section>
    );
};

export default Swiper;